In [33]:
#Making a directory
import numpy as np
import pandas as pd
dict1={ "Name":['Anushka','Rutuja','Aditya','Riya'],
         "Marks":[95,80,78,90],
         "City":['Ichakaranji','Pune','Ichalkaranji','Kolhapur',],
}
df=pd.DataFrame(dict1)
df

      Name  Marks          City
0  Anushka     95   Ichakaranji
1   Rutuja     80          Pune
2   Aditya     78  Ichalkaranji
3     Riya     90      Kolhapur

In [34]:
#converting dataframe into XlSheet or csv file
df.to_csv('Info.csv')
df.head(2) # printing first two rows of dataframe

      Name  Marks         City
0  Anushka     95  Ichakaranji
1   Rutuja     80         Pune

In [35]:
#Printing last two rows of dataframe
df.tail(2)

     Name  Marks          City
2  Aditya     78  Ichalkaranji
3    Riya     90      Kolhapur

In [36]:
#if we don't want index in the sheet
df.to_csv('Info_index_false.csv',index=False)

In [17]:
#Printing the mean,count,std,min ,max of numerical data
df.describe()

           Marks
count   4.000000
mean   85.750000
std     8.098354
min    78.000000
25%    79.500000
50%    85.000000
75%    91.250000
max    95.000000

In [18]:
#Reading the csv file
df=pd.read_csv('Info.csv')

In [37]:
#Displaying only one row "Marks" in data
df['Marks']

0    95
1    80
2    78
3    90
Name: Marks, dtype: int64

In [21]:
#Returns the value stored at index 0
df['Marks'][0]

np.int64(95)

In [38]:
#Change the value at index
df['Marks'][2]=79

C:\Users\Anushka\AppData\Local\Temp\ipykernel_19832\3277657820.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Marks'][2]=79

In [39]:
df

      Name  Marks          City
0  Anushka     95   Ichakaranji
1   Rutuja     80          Pune
2   Aditya     79  Ichalkaranji
3     Riya     90      Kolhapur

In [40]:
df.index={'A','B','C','D'}
df

      Name  Marks          City
B  Anushka     95   Ichakaranji
A   Rutuja     80          Pune
D   Aditya     79  Ichalkaranji
C     Riya     90      Kolhapur

In [48]:
#Printing random values of no of rows
import numpy as np
import pandas as pd
newdf=pd.DataFrame(np.random.rand(10,5),index=np.arange(10))
newdf

          0         1         2         3         4
0  0.351571  0.202252  0.787317  0.352163  0.581516
1  0.792170  0.475058  0.041318  0.445682  0.045472
2  0.034793  0.635065  0.471307  0.368997  0.944136
3  0.817459  0.472707  0.858723  0.811795  0.354157
4  0.955933  0.765625  0.487398  0.178853  0.466840
5  0.798857  0.335233  0.377882  0.606153  0.274588
6  0.823107  0.443695  0.805453  0.262356  0.968795
7  0.600834  0.107140  0.874345  0.142726  0.463220
8  0.994582  0.412037  0.340390  0.495975  0.236287
9  0.962827  0.707807  0.442519  0.324526  0.810306

In [49]:
#Printing the index of dataframe
newdf.index

Index([0, 1, 2, 3, 4, 5, 6, 7, 8, 9], dtype='int64')

In [50]:
#Gives the columns of dataframe
newdf.columns

RangeIndex(start=0, stop=5, step=1)

In [51]:
#printing the datatypes of all columns
newdf.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [21]:
#Changing the datatype of the field in dataframe
newdf[0][0]="Anushka"

In [52]:
newdf.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [53]:
#Converting the dataframe into array
newdf.to_numpy()

array([[0.35157071, 0.20225171, 0.78731677, 0.35216318, 0.58151574],
       [0.79217001, 0.4750575 , 0.04131835, 0.44568194, 0.04547207],
       [0.03479292, 0.6350646 , 0.47130669, 0.36899735, 0.94413614],
       [0.81745893, 0.47270742, 0.85872326, 0.81179473, 0.35415715],
       [0.95593267, 0.76562477, 0.48739838, 0.17885312, 0.46684021],
       [0.79885742, 0.33523314, 0.37788163, 0.60615314, 0.2745883 ],
       [0.82310746, 0.44369502, 0.80545276, 0.26235556, 0.9687946 ],
       [0.60083379, 0.10713951, 0.87434459, 0.14272559, 0.46321972],
       [0.9945816 , 0.41203667, 0.34038979, 0.49597475, 0.23628706],
       [0.9628274 , 0.70780742, 0.44251914, 0.3245258 , 0.81030591]])

In [54]:
#Printing the transpose of array
newdf.T

,0,1,2,3,4,5,6,7,8,9
0,0.351571,0.792170,0.034793,0.817459,0.955933,0.798857,0.823107,0.600834,0.994582,0.962827
1,0.202252,0.475058,0.635065,0.472707,0.765625,0.335233,0.443695,0.107140,0.412037,0.707807
2,0.787317,0.041318,0.471307,0.858723,0.487398,0.377882,0.805453,0.874345,0.340390,0.442519
3,0.352163,0.445682,0.368997,0.811795,0.178853,0.606153,0.262356,0.142726,0.495975,0.324526
4,0.581516,0.045472,0.944136,0.354157,0.466840,0.274588,0.968795,0.463220,0.236287,0.810306

In [55]:
#Printing the type of data
type(newdf[0])

pandas.core.series.Series

In [56]:
#Making the value immutable
newdf.loc[0,0]=654
newdf.head(2)

           0         1         2         3         4
0  654.00000  0.202252  0.787317  0.352163  0.581516
1    0.79217  0.475058  0.041318  0.445682  0.045472

In [57]:
#Deleting the column at index 1
newdf.drop(0,axis=1)

          1         2         3         4
0  0.202252  0.787317  0.352163  0.581516
1  0.475058  0.041318  0.445682  0.045472
2  0.635065  0.471307  0.368997  0.944136
3  0.472707  0.858723  0.811795  0.354157
4  0.765625  0.487398  0.178853  0.466840
5  0.335233  0.377882  0.606153  0.274588
6  0.443695  0.805453  0.262356  0.968795
7  0.107140  0.874345  0.142726  0.463220
8  0.412037  0.340390  0.495975  0.236287
9  0.707807  0.442519  0.324526  0.810306

In [58]:
#Sorting the array in descending order
newdf.sort_index(axis=0,ascending=False)

            0         1         2         3         4
9    0.962827  0.707807  0.442519  0.324526  0.810306
8    0.994582  0.412037  0.340390  0.495975  0.236287
7    0.600834  0.107140  0.874345  0.142726  0.463220
6    0.823107  0.443695  0.805453  0.262356  0.968795
5    0.798857  0.335233  0.377882  0.606153  0.274588
4    0.955933  0.765625  0.487398  0.178853  0.466840
3    0.817459  0.472707  0.858723  0.811795  0.354157
2    0.034793  0.635065  0.471307  0.368997  0.944136
1    0.792170  0.475058  0.041318  0.445682  0.045472
0  654.000000  0.202252  0.787317  0.352163  0.581516

In [59]:
#Changing the index of column
newdf.columns=list('ABCDE')
newdf.head()

            A         B         C         D         E
0  654.000000  0.202252  0.787317  0.352163  0.581516
1    0.792170  0.475058  0.041318  0.445682  0.045472
2    0.034793  0.635065  0.471307  0.368997  0.944136
3    0.817459  0.472707  0.858723  0.811795  0.354157
4    0.955933  0.765625  0.487398  0.178853  0.466840

In [30]:
#Printing the values at particular row and column
newdf.loc[[1,2],['C','D']]

          C         D
1  0.927852  0.706594
2  0.485136  0.927508

In [31]:
newdf.loc[(newdf['A']<0.3)]   #Prints the values in  less than 0.3

          A         B         C         D         E
4  0.213727  0.543550  0.081554  0.599873  0.131388
5  0.077664  0.189916  0.161695  0.840441  0.293070

In [32]:
# Printing the value at index
newdf.iloc[0,4]

np.float64(0.683088800686739)

In [60]:
# Checking that value is null or not
newdf['B'].isnull()

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7    False
8    False
9    False
Name: B, dtype: bool

In [63]:
# Making value none
newdf['A']=None
newdf

      A         B         C         D         E
0  None  0.202252  0.787317  0.352163  0.581516
1  None  0.475058  0.041318  0.445682  0.045472
2  None  0.635065  0.471307  0.368997  0.944136
3  None  0.472707  0.858723  0.811795  0.354157
4  None  0.765625  0.487398  0.178853  0.466840
5  None  0.335233  0.377882  0.606153  0.274588
6  None  0.443695  0.805453  0.262356  0.968795
7  None  0.107140  0.874345  0.142726  0.463220
8  None  0.412037  0.340390  0.495975  0.236287
9  None  0.707807  0.442519  0.324526  0.810306

In [74]:
import numpy as np
import pandas as pd
dict2={
       "Name":['Rocky','Alisha','john','Rocky'],
       "Salary":[10000,20000,30000,40000],
       "ID":[123,456,123,963],
}
df=pd.DataFrame(dict2)
df

     Name  Salary   ID
0   Rocky   10000  123
1  Alisha   20000  456
2    john   30000  123
3   Rocky   40000  963

In [75]:
df['Salary'].isnull()

0    False
1    False
2    False
3    False
Name: Salary, dtype: bool

In [86]:
#Skipping the dulpicate values
df.drop_duplicates(subset=['ID'])

     Name  Salary   ID
0   Rocky   10000  123
1  Alisha   20000  456
3   Rocky   40000  963

In [81]:
#Printing the shape of dataframe
df.shape

(4, 3)

In [82]:
#Printing information
df.info

<bound method DataFrame.info of      Name  Salary   ID
0   Rocky   10000  123
1  Alisha   20000  456
2    john   30000  123
3   Rocky   40000  963>

In [89]:
#Skipping first and keeping last duplicate value
df.drop_duplicates(subset=['Name'],keep='last')

     Name  Salary   ID
1  Alisha   20000  456
2    john   30000  123
3   Rocky   40000  963

In [90]:
#Counting the no. of unique values not removing null values
df['Salary'].value_counts(dropna=False)

Salary
10000    1
20000    1
30000    1
40000    1
Name: count, dtype: int64

In [91]:
#Checking there are not any null values in the dataframe
df.notnull()

   Name  Salary    ID
0  True    True  True
1  True    True  True
2  True    True  True
3  True    True  True

In [93]:
#Computes correlation matrix
df.corr

<bound method DataFrame.corr of      Name  Salary   ID
0   Rocky   10000  123
1  Alisha   20000  456
2    john   30000  123
3   Rocky   40000  963>